code-review/NRB_3471_3546/База_Было/InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегионаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/АдресныйКлассификатор/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Элементы.Список.РежимВыбора = Истина;
 	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТД.Код > 0 Тогда
		
		НадписьРодителей = КонтактнаяИнформация.ПолучитьПолноеНазвание(ТД.Код);
		Индекс = ТД.Индекс;
		
	Иначе
		НадписьРодителей = "Не выбран элемент для детализации сведений!";
		Индекс = "";
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ СПИСКА

// Процедура устанавливает "родителя" для постороения условий отбора по переданным
// уже заполненным адресным полям
//
// Параметры: 
// Параметры: 
//  НазваниеРегиона - название региона( с сокращением)
//  НазваниеРайона - название района( с сокращением)
//  НазваниеГорода - название города( с сокращением)
//  НазваниеНаселенногоПункта - название населенного пункта( с сокращением)
//
Процедура УстановитьРодителя(Знач НазваниеРегиона, Знач НазваниеРайона, Знач НазваниеГорода, Знач НазваниеНаселенногоПункта) Экспорт

	РодительскийЭлемент = КонтактнаяИнформация.ПолучитьПустуюСтруктуруАдреса();
	КодРодителяРодителя = 0;

	Регион = КонтактнаяИнформация.ПолучитьАдресныйЭлемент(КонтактнаяИнформация.ОбрезатьСокращение(НазваниеРегиона), 1);
	Если Регион.Код > 0 Тогда
		РодительскийЭлемент = Регион;
		КодРодителяРодителя = Регион.Код;
	КонецЕсли;
	
	Район = КонтактнаяИнформация.ПолучитьАдресныйЭлемент(КонтактнаяИнформация.ОбрезатьСокращение(НазваниеРайона), 2, КодРодителяРодителя);
	Если Район.Код > 0 Тогда
		РодительскийЭлемент = Район;
		КодРодителяРодителя = Район.Код;
	КонецЕсли;
	
	Город = КонтактнаяИнформация.ПолучитьАдресныйЭлемент(КонтактнаяИнформация.ОбрезатьСокращение(НазваниеГорода), 3, КодРодителяРодителя);	
	Если Город.Код > 0 Тогда
		РодительскийЭлемент = Город;
		КодРодителяРодителя = Город.Код;
	КонецЕсли;
	
	НаселенныйПункт = КонтактнаяИнформация.ПолучитьАдресныйЭлемент(КонтактнаяИнформация.ОбрезатьСокращение(НазваниеНаселенногоПункта), 4, КодРодителяРодителя);
	
	Если НаселенныйПункт.Код > 0 Тогда
		РодительскийЭлемент = НаселенныйПункт;
		КодРодителяРодителя = НаселенныйПункт.Код;
	КонецЕсли;
	
	КодРодительскогоЭлемента = РодительскийЭлемент.Код;
		
	КодРегионаРодительскогоЭлемента   = Цел(КодРодительскогоЭлемента / КонтактнаяИнформация.МаскаРегиона());
	КодРайонаРодительскогоЭлемента    = Цел(КодРодительскогоЭлемента / КонтактнаяИнформация.МаскаРайона()) % 1000;
	КодГородаРодительскогоЭлемента    = Цел(КодРодительскогоЭлемента / КонтактнаяИнформация.МаскаГорода()) % 1000;
	КодНасПунктаРодительскогоЭлемента = Цел(КодРодительскогоЭлемента / КонтактнаяИнформация.МаскаНасПункта()) % 1000;
	КодУлицыРодительскогоЭлемента     = Цел(КодРодительскогоЭлемента / КонтактнаяИнформация.МаскаУлицы())% 10000;
	
КонецПроцедуры


// Процедура устанавливает условия отбора для демонстрации в списке для 
// выбора только регионов
//
// Параметры: 
//  нет
//
Процедура ОтобратьТолькоРегионы() Экспорт
	
	Список.Отбор.Элементы.Очистить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипАдресногоЭлемента", 1, ВидСравненияКомпоновкиДанных.Равно,, Истина);	

КонецПроцедуры

// Процедура устанавливает условия отбора для демонстрации в списке для 
// выбора только регионов
//
// Параметры: 
//  нет
//
Процедура ОтобратьТолькоРайоны() Экспорт
	
	Если КодРодительскогоЭлемента = 0 Тогда
		ОтключитьЭлементОтбораСписка("КодРегионаВКоде");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРегионаВКоде", КодРегионаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	ОтключитьЭлементОтбораСписка("КодРайонаВКоде");
	ОтключитьЭлементОтбораСписка("КодГородаВКоде");
	ОтключитьЭлементОтбораСписка("КодНаселенногоПунктаВКоде");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипАдресногоЭлемента", 2, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
КонецПроцедуры

// Процедура устанавливает условия отбора для демонстрации в списке для 
// выбора только районов
//
// Параметры: 
//  нет
//
Процедура ОтобратьТолькоГорода() Экспорт

	Если КодРодительскогоЭлемента = 0 Тогда
		ОтключитьЭлементОтбораСписка("КодРегионаВКоде");
		ОтключитьЭлементОтбораСписка("КодРайонаВКоде");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРегионаВКоде", КодРегионаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРайонаВКоде", КодРайонаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	ОтключитьЭлементОтбораСписка("КодГородаВКоде");
	ОтключитьЭлементОтбораСписка("КодНаселенногоПунктаВКоде");

    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипАдресногоЭлемента", 3, ВидСравненияКомпоновкиДанных.Равно,, Истина);

КонецПроцедуры

// Процедура устанавливает условия отбора для демонстрации в списке для 
// выбора только населенных пунктов
//
// Параметры: 
//  нет
//
Процедура ОтобратьТолькоНаселенныеПункты() Экспорт

	Если КодРодительскогоЭлемента = 0 Тогда
		ОтключитьЭлементОтбораСписка("КодРегионаВКоде");
		ОтключитьЭлементОтбораСписка("КодРайонаВКоде");
		ОтключитьЭлементОтбораСписка("КодГородаВКоде");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРегионаВКоде", КодРегионаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРайонаВКоде", КодРайонаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодГородаВКоде", КодГородаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);		 
	КонецЕсли;
	
	ОтключитьЭлементОтбораСписка("КодНаселенногоПунктаВКоде");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипАдресногоЭлемента", 4, ВидСравненияКомпоновкиДанных.Равно,, Истина);

КонецПроцедуры

// Процедура устанавливает условия отбора для демонстрации в списке для 
// выбора только улиц
//
// Параметры: 
//  нет
//
Процедура ОтобратьТолькоУлицы() Экспорт

	Если КодРодительскогоЭлемента = 0 Тогда
		ОтключитьЭлементОтбораСписка("КодРегионаВКоде");
		ОтключитьЭлементОтбораСписка("КодРайонаВКоде");
		ОтключитьЭлементОтбораСписка("КодГородаВКоде");
		ОтключитьЭлементОтбораСписка("КодНаселенногоПунктаВКоде");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРегионаВКоде", КодРегионаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодРайонаВКоде", КодРайонаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодГородаВКоде", КодГородаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "КодНаселенногоПунктаВКоде", КодНасПунктаРодительскогоЭлемента, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипАдресногоЭлемента", 5, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	
КонецПроцедуры    

&НаСервере
Процедура ОтключитьЭлементОтбораСписка(ИмяПоля)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ИмяПоля,, ВидСравненияКомпоновкиДанных.Равно,, Ложь);	
КонецПроцедуры
